Revit 2026 API

# AnalyticalNodeConnectionStatus Enumeration

---

Indicates the Connections Status for an Analytical Node.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalNodeConnectionStatus
```
```vb
Public Enumeration AnalyticalNodeConnectionStatus
```
```cpp
public enum class AnalyticalNodeConnectionStatus
```
```fsharp
type AnalyticalNodeConnectionStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| Connected | 1 | Connected |
| Unconnected | 0 | Unconnected node (only one connected element) |

#### Reference

Autodesk.Revit.DB.Structure Namespace